function parseLrc(text: string) {
  return text
    .split("\n")
    .map((string) => string.match(/\[(.*):(.*)\](?:<s:(.*?)>)?(?:<r:(.*?)>)?(.*)/))
    .filter(Boolean)
    .map(match => (console.log(match), match))
    .map((match): Lyric => ({
      time: (parseFloat(match![1]) * 60 + parseFloat(match![2])) * 1000,
      text: match![5],
      fontSize: match![3] ? parseFloat(match![3]) : undefined,
      relative: match![4] ? parseFloat(match![4]) : undefined,
    }))
    .map(match => (console.log(match), match));
}

const lyrics = parseLrc(`
[00:11.00]<s:3>命に嫌われている。
[00:13.50] 作曲 : カンザキイオリ
[00:15.50] 作词 : カンザキイオリ
[00:17.50] 演唱 : まふまふ
[00:20.30]「死にたいなんて言うなよ。」
[00:22.86]「諦めないで生きろよ。」
[00:24.96]そんな歌が正しいなんて馬鹿げてるよな。
[00:29.45]実際自分は死んでもよくて
[00:32.13]周りが死んだら悲しくて
[00:34.46]「それが嫌だから」っていう
[00:36.95]エゴなんです。
[00:39.55]他人が生きてもどうでもよくて
[00:41.97]誰かを嫌うこともファッションで
[00:44.40]それでも「平和に生きよう」
[00:46.69]なんて素敵なことでしょう。
[00:49.06]画面の先では誰かが死んで
[00:51.53]それを嘆いて誰かが歌って
[00:53.93]それに感化された少年が
[00:56.33]ナイフを持って走った。
[00:58.20]<s:2.8>僕らは命に嫌われている。
[01:00.80]価値観もエゴも押し付けて
[01:03.13]いつも誰かを殺したい歌を
[01:05.57]簡単に電波で流した。
[01:07.79]僕らは命に嫌われている。
[01:10.37]軽々しく死にたいだとか
[01:12.56]軽々しく命を見てる僕らは
[01:15.50]<s:3>命に嫌われている。
[01:27.46]お金がないので今日も一日中惰眠を謳歌する。
[01:32.37]生きる意味なんて見出せず、無駄を自覚して息をする。
[01:37.13]<s:7>「寂しい」
[01:37.82]<r:4>なんて言葉で
[01:39.26]<r:4>この傷が表せてもいいものか
[01:41.97]そんな意地ばかり抱え今日も一人ベッドに眠る
[01:46.49]少年だった僕たちは
[01:49.02]いつか青年に変わっていく。
[01:51.50]年老いていつか枯葉のように
[01:53.95]誰にも知られず朽ちていく。
[01:56.22]不死身の身体を手に入れて、
[01:58.66]一生死なずに生きていく。
[02:01.04]そんなＳＦを妄想してる。
[02:05.92]自分が死んでもどうでもよくて
[02:08.24]それでも周りに生きて欲しくて
[02:10.65]矛盾を抱えて生きてくなんて
[02:12.93]<r:4>怒られてしまう。
[02:15.45]「正しいものは正しくいなさい。」
[02:17.83]「死にたくないなら生きていなさい。」
[02:20.20]悲しくなるならそれでもいいなら
[02:22.69]ずっと一人で笑えよ。
[02:24.56]僕らは命に嫌われている。
[02:27.33]幸福の意味すらわからず、
[02:29.42]産まれた環境ばかり憎んで
[02:32.05]簡単に過去ばかり呪う。
[02:34.26]僕らは命に嫌われている。
[02:36.79]さよならばかりが好きすぎて
[02:39.26]本当の別れなど知らない僕らは
[02:41.87]<s:3>命に嫌われている。
[02:53.49]幸福も
[02:55.05]<r:10>別れも
[02:56.38]<r:10>愛情も
[02:57.37]<r:10>友情も
[02:58.45]滑稽な夢の戯れで
[03:01.01]全部カネで買える代物。
[03:03.42]<s:7>明日、
[03:04.15]<s:4><r:30>死んでしまうかもしれない。
[03:06.00]<s:7>全て、
[03:06.66]<s:4><r:30>無駄になるかもしれない。
[03:08.20]朝も
[03:08.96]<r:10>夜も
[03:09.52]<r:10>春も
[03:10.17]<r:10>秋も
[03:10.74]変わらず誰かがどこかで死ぬ。
[03:13.00]夢も明日も何もいらない。
[03:15.45]君が生きていたならそれでいい。
[03:17.75]そうだ。
[03:18.84]<r:4>本当は
[03:20.26]<r:4>そういうことが歌いたい。
[03:22.70]命に嫌われている。
[03:24.92]結局いつかは死んでいく。
[03:27.21]君だって
[03:28.44]<r:4>僕だって
[03:29.63]<r:4>いつかは枯葉のように朽ちてく。
[03:31.85]<s:2.3>それでも僕らは必死に生きて
[03:34.44]<s:2.3>命を必死に抱えて生きて
[03:36.73]<s:6><r:4>殺して
[03:37.41]<s:6><r:4>あがいて
[03:37.99]<s:6><r:4>笑って
[03:38.55]<s:6><r:4>抱えて
[03:39.37]<s:6><r:4>生きて、
[03:40.03]<s:6><r:4>生きて、
[03:40.59]<s:6><r:4>生きて、
[03:41.09]<s:6><r:4>生きて、
[03:41.87]<s:6><r:4>生きろ。`)

const chineseLyrics = parseLrc(`
[00:10.00]<s:3>被生命所厌恶。
[00:12.00] 作曲 : カンザキイオリ
[00:14.00] 作词 : カンザキイオリ
[00:20.30]「不要说想死这种话。」
[00:22.86]「不要放弃继续活下去。」
[00:24.96]这种曲子居然是正确的简直太可笑了。
[00:29.45]实际上是自己死了也无所谓
[00:32.13]但是如果周围的人死去就会难过
[00:34.46]「我就是讨厌那种场面」
[00:36.95]一种自私的想法而已。
[00:39.55]别人活下去了也与自己毫不相干
[00:41.97]讨厌某个人也不过为了追逐时髦
[00:44.40]即使如此还能说出「平稳地活下去吧」
[00:46.69]这种冠冕堂皇的漂亮话。
[00:49.06]画面背后有人死去
[00:51.53]有人心生哀叹为其谱曲
[00:53.93]而被曲子感化的少年
[00:56.33]拿着小刀跑了起来。
[00:58.20]<s:2.8>我们被生命所厌恶。
[01:00.80]把价值观和自私自利的想法推诿于他物
[01:03.13]总是简单地用电波
[01:05.57]播放意欲杀掉某人的歌曲。
[01:07.79]我们被生命所厌恶。
[01:10.37]轻飘飘地说出「想死」这种话
[01:12.56]如此轻贱生命的我们
[01:15.50]<s:3>被生命所厌恶。
[01:27.46]因为没钱今天也心安理得地瞌睡着度过了一天。
[01:32.37]看不出有什么活下去的意义，明知无用却还在继续呼吸。
[01:37.13]<s:7>「好寂寞」
[01:37.82]<r:4>怎么能因为这种借口
[01:39.26]<r:4>而给别人展示这道伤口呢
[01:41.97]今天也怀着如此固执的想法独自一人进入睡梦
[01:46.49]曾经都是少年的我们
[01:49.02]终有一天会变为青年。
[01:51.50]年老之后会如枯叶一般
[01:53.95]在不为人知的情况下腐朽。
[01:56.22]如果能得到不老不死的身体、
[01:58.66]就可以永远活下去。
[02:01.04]妄想着那种科幻小说里的场景。
[02:05.92]即使自己死去也无所谓
[02:08.24]但是又希望周围的人能活下去
[02:10.65]如果怀抱着矛盾活下去
[02:12.93]<r:4>会惹别人生气的。
[02:15.45]「正确的东西就要以正确的形式存在。」
[02:17.83]「不想死就活下去。」
[02:20.20]如果愿意身陷悲伤之情
[02:22.69]那就一直一个人笑下去吧。
[02:24.56]我们被生命所厌恶。
[02:27.33]不知道幸福的意义、
[02:29.42]只会去憎恨与生俱来的环境
[02:32.05]只会一味地诅咒过去。
[02:34.26]我们被生命所厌恶。
[02:36.79]偏好诉说分别的言语
[02:39.26]却根本不了解生离死别的我们
[02:41.87]<s:3>被生命所厌恶。
[02:53.49]幸福也好
[02:55.05]<r:10>离别也好
[02:56.38]<r:10>爱情也好
[02:57.37]<r:10>友情也好
[02:58.45]都是美梦中的滑稽儿戏
[03:01.01]都可以用金钱置换。
[03:03.42]<s:7>明天、
[03:04.15]<s:4>可能就会死去。
[03:06.00]<s:7>一切、
[03:06.66]<s:4>都可能会毫无意义。
[03:08.20]朝朝
[03:08.96]<r:10>暮暮
[03:09.52]<r:10>春日
[03:10.17]<r:10>秋天
[03:10.74]不变的是总有人在某处死去。
[03:13.00]无论是梦想明天还是任何东西都不需要。
[03:15.45]只要你能活着就好。
[03:17.75]对了。
[03:18.84]<r:4>原来
[03:20.26]<r:4>我是想唱出这样的曲子啊。
[03:22.70]被生命所厌恶。
[03:24.92]结果总有一天会死去。
[03:27.21]无论是你
[03:28.44]<r:4>还是我
[03:29.63]<r:4>总有一天会像枯叶一样腐烂。
[03:31.85]<s:2.3>即使如此我们也会拼命活下去
[03:34.44]<s:2.3>拼命背负着生命活下去
[03:36.73]<s:6><r:4>抹杀
[03:37.41]<s:6><r:4>挣扎
[03:37.99]<s:6><r:4>欢笑
[03:38.55]<s:6><r:4>背负
[03:39.37]<s:6><r:4>活着、
[03:40.03]<s:6><r:4>活着、
[03:40.59]<s:6><r:4>活着、
[03:41.09]<s:6><r:4>活着、
[03:41.87]<s:6><r:4>活下去。`)

export { lyrics, chineseLyrics };

export interface Lyric {
  time: number;
  text: string;
  fontSize?: number;
  relative?: number;
}